local L = LibStub("AceLocale-3.0"):NewLocale("LFGSorter", "ruRU")

if L then
L['Raids & other'] = 'Рейды и пр.';
L['5 ppl 1'] = 'low lvl инсты';
L['5 ppl 2'] = 'high lvl инсты';
L['5 ppl bk'] = 'low lvl инсты БК';
L['5 ppl bk2'] = 'high lvl инсты БК';
L['hero bk'] = 'Героики БК';
L['hero bk2'] = 'Героики БК 2';
L['raid bk'] = 'Рейды БК';

L['Inst1'] = 'Определять low lvl инст.';
L['Inst2'] = 'Определять high lvl инст.';
L['Inst3'] = 'Определять рейды';
L['Inst4'] = 'Определять инсты БК';
L['Inst5'] = 'Определять героики БК';
L['Inst6'] = 'Определять рейды БК';

L['Reset'] = 'Загрузить стандартные настройки';
L['LFG sorter loading default'] = 'Загружаются настройки LFGSorter';

L['будут скрыты из чата'] = 'будут скрыты из чата';
L['будут показаны в чате'] = 'будут показаны в чате';
L['Звук включен'] = 'Звук включен';
L['Звук выключен'] = 'Звук выключен';
L['Сообщения в '] = 'Сообщения в ';
L[' обрабатываются аддоном - '] = ' обрабатываются аддоном - ';
L['Настройки LFG sorter'] = 'Настройки LFG sorter';

L['channel 1'] = 'канал 1';
L['channel 2'] = 'канал 2';
L['channel 3'] = 'канал 3';
L['channel 4'] = 'канал 4';
L['channel 5'] = 'канал 5';
L['channel 6'] = 'канал 6';

L['скрыть'] = 'скрыть';
L['звук'] = 'звук';

L['АФК'] = 'АФК';
L['БАФФ'] = 'БАФФ';

L['МАО'] = 'МАО';
L['МАРА'] = 'МАРА';
L['КТК'] = 'КТК';
L['ЛИ'] = 'ЛИ';
L['ГЧГ'] = 'ГЧГ';
L['ЗФ'] = 'ЗФ';
L['НП'] = 'НП';
L['УЛЬДА'] = 'УЛЬДА';
L['КИ'] = 'КИ';
L['ПС'] = 'ПС';
L['ХРАМ'] = 'ХРАМ';
L['МК'] = 'МК';
L['ТЮ'] = 'ТЮ';
L['ГНОМ'] = 'ГНОМ';
L['ДМ'] = 'ДМ';
L['СТРАТ'] = 'СТРАТ';
L['ШОЛО'] = 'ШОЛО';
L['ОП'] = 'ОП';
L['ЛБРС'] = 'ЛБРС';
L['УБРС'] = 'УБРС';

L['ЗГ'] = 'ЗГ';
L['АК20'] = 'АК20';
L['ОНЯ'] = 'ОНЯ';
L['ОН'] = 'ОН';
L['АК40'] = 'АК40';
L['БВЛ'] = 'БВЛ';
L['НАКС'] = 'НАКС';

L['БАСТ'] = 'БАСТ'; -- бастионы адского пламени
L['КК'] = 'КК'; -- кузня крови
L['УЗИ'] = 'УЗИ'; -- узилище
L['ТОПЬ'] = 'ТОПЬ'; -- нижнетопь
L['ГМ'] = 'ГМ'; -- гробницы маны
L['АУКГ'] = 'АУКГ'; -- аукенайские гробницы
L['ПВ1'] = 'ПВ1'; -- предгорья хилсбрада
L['СЗ'] = 'СЗ'; -- сеттекские залы
L['ПП'] = 'ПП'; -- паровое подземелье
L['ТЛ'] = 'ТЛ'; -- темный лабиринт
L['РЗ'] = 'РЗ'; -- разрушенные залы
L['МЕХ'] = 'МЕХ'; -- механар
L['БОТ'] = 'БОТ'; -- ботаника
L['ЧТ'] = 'ЧТ'; -- Черные топи
L['АРКА'] = 'АРКА'; -- акратрац
L['ТМ'] = 'ТМ'; -- террасса магистров


L['Г-БАСТ'] = 'Г-БАСТ'; -- бастионы адского пламени
L['Г-КК'] = 'Г-КК'; -- кузня крови
L['Г-УЗИ'] = 'Г-УЗИ'; -- узилище
L['Г-ТОПЬ'] = 'Г-ТОПЬ'; -- нижнетопь
L['Г-ГМ'] = 'Г-ГМ'; -- гробницы маны
L['Г-АУКГ'] = 'Г-АУКГ'; -- аукенайские гробницы
L['Г-ПВ1'] = 'Г-ПВ1'; -- предгорья хилсбрада
L['Г-СЗ'] = 'Г-СЗ'; -- сеттекские залы
L['Г-ПП'] = 'Г-ПП'; -- паровое подземелье
L['Г-ТЛ'] = 'Г-ТЛ'; -- темный лабиринт
L['Г-РЗ'] = 'Г-РЗ'; -- разрушенные залы
L['Г-МЕХ'] = 'Г-МЕХ'; -- механар
L['Г-БОТ'] = 'Г-БОТ'; -- ботаника
L['Г-ЧТ'] = 'Г-ЧТ'; -- Черные топи
L['Г-АРКА'] = 'Г-АРКА'; -- акратрац
L['Г-ТМ'] = 'Г-ТМ'; -- террасса магистров


L['КАРА'] = 'КАРА'; -- каражан
L['ГРУУЛ'] = 'ГРУУЛ'; -- Груул
L['МАГТ'] = 'МАГТ'; -- Магтеридон
L['ЗА'] = 'ЗА'; -- зул аман
L['ЗС'] = 'ЗС'; -- змеиное святилище
L['ТК'] = 'ТК'; -- око бурь
L['ХИДЖ'] = 'ХИДЖ'; -- Вершина Хиджала 
L['ХРАМ'] = 'ХРАМ'; -- Черный Храм 
L['ПСК'] = 'ПСК'; --Плато Солнечного Колодца 	

LFGSort_Inst1 = {};
LFGSort_Inst2 = {};
LFGSort_Inst3 = {};
LFGSort_Inst4 = {};
LFGSort_Inst5 = {};
LFGSort_Inst6 = {};

LFGSort_Inst_ect = {};

	-- 0. AFK / boost /
	LFGSort_Inst_ect['АФК'] = 'АФК';
	LFGSort_Inst_ect['AFK'] = 'АФК';
	LFGSort_Inst_ect['[Аа]фк'] = 'АФК';
	LFGSort_Inst_ect['БУСТ'] = 'АФК';
	LFGSort_Inst_ect['[Бб]уст'] = 'АФК';
	LFGSort_Inst_ect['[Bb]oost'] = 'АФК';
	LFGSort_Inst_ect['BOOST'] = 'АФК';
	LFGSort_Inst_ect['g%-ран'] = 'АФК';
	LFGSort_Inst_ect['g ран'] = 'АФК';
	LFGSort_Inst_ect['g/ран'] = 'АФК';
	LFGSort_Inst_ect['г%-ран'] = 'АФК';
	LFGSort_Inst_ect['г ран'] = 'АФК';
	LFGSort_Inst_ect['г/ран'] = 'АФК';
	-- 1. Баффы ДМ
	LFGSort_Inst_ect['[бБ]аф.*[^А-ЯЁ%a]ДМ[^А-ЯЁ%a]'] = 'БАФФ';
	LFGSort_Inst_ect['[бБ]аф.*[^А-ЯЁ%a]дм[^А-ЯЁ%a]'] = 'БАФФ';
	LFGSort_Inst_ect['БАФ.*[^А-ЯЁ%a]ДМ[^А-ЯЁ%a]'] = 'БАФФ';
	LFGSort_Inst_ect['БАФ.*[^А-ЯЁ%a]дм[^А-ЯЁ%a]'] = 'БАФФ';
	
	--LFGSort_Inst_ect['[Сс]ердце [хХ]'] = 'БАФФ';
	LFGSort_Inst_ect['.*[бБ]аф.*[Cс]ерд.*'] = 'БАФФ';
	LFGSort_Inst_ect['.*БАФФ.*[Cс]ерд.*'] = 'БАФФ';
	LFGSort_Inst_ect['БАФФ [Сс]ер'] = 'БАФФ';
	LFGSort_Inst_ect['БАФФ СЕР'] = 'БАФФ';
	
	LFGSort_Inst_ect['[^А-ЯЁ%a]ДМ[^А-ЯЁ%a].*[Бб]аф'] = 'БАФФ';
	LFGSort_Inst_ect['[^А-ЯЁ%a]дм[^А-ЯЁ%a].*[Бб]аф'] = 'БАФФ';
	LFGSort_Inst_ect['[^А-ЯЁ%a]дм[^А-ЯЁ%a].*БАФ'] = 'БАФФ';
	LFGSort_Inst_ect['[^А-ЯЁ%a]ДМ[^А-ЯЁ%a].*БАФ'] = 'БАФФ';
	LFGSort_Inst_ect['[^А-ЯЁ%a]Дм[^А-ЯЁ%a].*[Бб]аф'] = 'БАФФ';
	
	-- 1. ОП
	LFGSort_Inst1['[^А-ЯЁ%a]ОП[^А-ЯЁ%a]'] = 'ОП';
	-- 13. Мертвые копи
	LFGSort_Inst1['[^А-ЯЁ%a]мк[^А-ЯЁ%a]'] = 'МК';
	LFGSort_Inst1['[^А-ЯЁ%a]МК[^А-ЯЁ%a]'] = 'МК';
	LFGSort_Inst1['[Кк]опи'] = 'МК';
	-- 11. Пещеры стенаний
	LFGSort_Inst1['wc'] = 'ПС';
	LFGSort_Inst1['[^А-ЯЁ%a]ПС[^А-ЯЁ%a]'] = 'ПС';
	LFGSort_Inst1['[Сс]тенаний'] = 'ПС';
	LFGSort_Inst1['СТЕНАНИЙ'] = 'ПС';
	-- 4. КТК
	LFGSort_Inst1['[Тт]емного клыка'] = 'КТК';
	LFGSort_Inst1['ТЕМНОГО КЛЫКА'] = 'КТК';
	LFGSort_Inst1['[^А-ЯЁ%a]КТК[^А-ЯЁ%a]'] = 'КТК';
	LFGSort_Inst1['[^А-ЯЁ%a]ктк'] = 'КТК';
	-- 8. НП пучина
	LFGSort_Inst1['[^А-ЯЁ%a]НП[^А-ЯЁ%a]'] = 'НП';
	LFGSort_Inst1['[Пп]учин'] = 'НП';
	LFGSort_Inst1['ПУЧИН'] = 'НП';
	-- 14. Тюрьма
	LFGSort_Inst1['[тТ]юрьм'] = 'ТЮ';
	-- 16. Гномер
	LFGSort_Inst1['[гГ]номер'] = 'ГНОМ';
	LFGSort_Inst1['ГНОМЕР'] = 'ГНОМ';
	LFGSort_Inst1['ГНОМРЕ'] = 'ГНОМ';
	LFGSort_Inst1['[гГ]номре'] = 'ГНОМ';
	LFGSort_Inst1['[Gg]nomer'] = 'ГНОМ';
	LFGSort_Inst1['[Gg]nomre'] = 'ГНОМ';

	-- 5. ЛИ
	LFGSort_Inst1['[^А-ЯЁ%a]ЛИ[^А-ЯЁ%a]'] = 'ЛИ'; -- без ИЛИ
	LFGSort_Inst1['[лЛ]абиринты'] = 'ЛИ';
	
	-- 2. МАО
	LFGSort_Inst1['мао'] = 'МАО';
	LFGSort_Inst1['МАО'] = 'МАО';
	LFGSort_Inst1['[мМ]онастырь'] = 'МАО';
	LFGSort_Inst1['[^А-ЯЁ%a]СМ[^А-ЯЁ%a]'] = 'МАО';
	LFGSort_Inst1['[^А-ЯЁ%a]SM[^А-ЯЁ%a]'] = 'МАО';
	LFGSort_Inst1['[кК]ладбищ'] = 'МАО';
	LFGSort_Inst1['[бБ]иблиотек'] = 'МАО';
	LFGSort_Inst1['[сС]обор'] = 'МАО';
	
	-- 10. Курганы И
	LFGSort_Inst1['[^А-ЯЁ%a]КИ[^А-ЯЁ%a]'] = 'КИ';
	LFGSort_Inst1['[Кк]урган'] = 'КИ'; -- КУРГАНЫ
	LFGSort_Inst1['КУРГАН'] = 'КИ';

	
	-- 3. Мародон
	LFGSort_Inst2['марадон'] = 'МАРА';
	LFGSort_Inst2['[мМ]ара[уд%s]'] = 'МАРА';
	LFGSort_Inst2['[мМ]аро[уд]'] = 'МАРА';
	LFGSort_Inst2['МАРА'] = 'МАРА';
	LFGSort_Inst2['МАРОД'] = 'МАРА';
	LFGSort_Inst2['[^А-ЯЁ%a][Мм]ару'] = 'МАРА';

	-- 7. ЗФ
	LFGSort_Inst2['[^А-ЯЁ%a]ЗФ[^А-ЯЁ%a]'] = 'ЗФ';
	LFGSort_Inst2['[фФ]арак'] = 'ЗФ';
	LFGSort_Inst2['ФАРАК'] = 'ЗФ';
	LFGSort_Inst2['[фФ]аррак'] = 'ЗФ';
	LFGSort_Inst2['ФАРРАК'] = 'ЗФ';
	
	-- 9. Ульдаман
	LFGSort_Inst2['[уУ]ль?да'] = 'УЛЬДА';
	LFGSort_Inst2['УЛЬ?ДА'] = 'УЛЬДА';

	-- 12. Храм
	LFGSort_Inst2['[хХ]рам'] = 'ХРАМ';
	LFGSort_Inst2['ХРАМ'] = 'ХРАМ';
	LFGSort_Inst2['[хХ]аккар'] = 'ХРАМ';
	LFGSort_Inst2['[аА]ттал'] = 'ХРАМ';
	LFGSort_Inst2['[аА]тал'] = 'ХРАМ';

	
	-- 6. ГЧГ
	LFGSort_Inst2['ГЧГ'] = 'ГЧГ';
	LFGSort_Inst2['ГчГ'] = 'ГЧГ';
	LFGSort_Inst2['Гчг'] = 'ГЧГ';
	LFGSort_Inst2['БРД'] = 'ГЧГ';
	LFGSort_Inst2['BRD'] = 'ГЧГ';
	LFGSort_Inst2['гчг'] = 'ГЧГ';
	LFGSort_Inst2['брд'] = 'ГЧГ';
	LFGSort_Inst2['brd'] = 'ГЧГ';
	
	-- 21. ЛБРС
	LFGSort_Inst2['ЛБРС'] = 'ЛБРС';
	LFGSort_Inst2['лбрс'] = 'ЛБРС';
	LFGSort_Inst2['lbrs'] = 'ЛБРС';

	
	-- 17. Страт
	LFGSort_Inst2['[сС]трат'] = 'СТРАТ';
	LFGSort_Inst2['СТРАТ'] = 'СТРАТ';
	-- 18. Шоло
	LFGSort_Inst2['ШОЛО'] = 'ШОЛО';
	LFGSort_Inst2['НЕКРОС'] = 'ШОЛО';
	LFGSort_Inst2['шоло'] = 'ШОЛО';
	LFGSort_Inst2['[шШ]оло'] = 'ШОЛО';
	LFGSort_Inst2['[Нн]екро'] = 'ШОЛО';
	
	-- 15. Забытый город
	LFGSort_Inst2['[^А-ЯЁ%a]ДМ[^А-ЯЁ%a]'] = 'ДМ';
	LFGSort_Inst2['[^А-ЯЁ%a]дм[^А-ЯЁ%a]'] = 'ДМ';
	LFGSort_Inst2['[^А-ЯЁ%a]трибут'] = 'ДМ';	
	
	-- 20. УБРС
	LFGSort_Inst2['УБРС'] = 'УБРС';
	LFGSort_Inst2['убрс'] = 'УБРС';
	LFGSort_Inst2['[Рр]енд.*[Рр]ан'] = 'УБРС';

	
	
	-- 22. ЗГ
	LFGSort_Inst3['Зг%s'] = 'ЗГ';
	LFGSort_Inst3['[^А-ЯЁ%a]ЗГ[^А-ЯЁ%a]'] = 'ЗГ';
	LFGSort_Inst3['[Гг]уруб'] = 'ЗГ';
	LFGSort_Inst3['ГУРУБ[^Аа]'] = 'ЗГ';
	-- 23. АК20
	LFGSort_Inst3['АК%s*20[^г]'] = 'АК20';
	LFGSort_Inst3['АКУ20'] = 'АК20';
	LFGSort_Inst3['АК20'] = 'АК20';
	LFGSort_Inst3['АКУ 20'] = 'АК20';
	LFGSort_Inst3['[^А-ЯЁ%a]АК 20'] = 'АК20';
	LFGSort_Inst3['AQ%s*20[^г]'] = 'АК20';
	LFGSort_Inst3['[аА]к.*20[^г]'] = 'АК20';
	LFGSort_Inst3['[кК]ираж%s*20[^г]'] = 'АК40';
	-- 24. АК40
	LFGSort_Inst3['АК40'] = 'АК40';
	LFGSort_Inst3['АКУ40'] = 'АК40';
	LFGSort_Inst3['АКУ 40'] = 'АК40';
	LFGSort_Inst3['АК 40'] = 'АК40';
	LFGSort_Inst3['АК.*40^г'] = 'АК40';
	LFGSort_Inst3['[^А-ЯЁ%a][Аа]к.*40[^г]'] = 'АК40';
	LFGSort_Inst3['[кК]ираж.*40[^г].*'] = 'АК40';
	-- 25. ОП
	LFGSort_Inst3['[^А-ЯЁ%a|(по )]МС[^А-ЯЁ>%a]'] = 'ОН';
	LFGSort_Inst3['[^А-ЯЁ%a]MC[^А-ЯЁ>%a]'] = 'ОН';
	LFGSort_Inst3['[mM]olten [Cc]ore'] = 'ОН';
	LFGSort_Inst3['[нН]едра'] = 'ОН';
	LFGSort_Inst3['НЕДРА'] = 'ОН';
	LFGSort_Inst3['[^А-ЯЁ%a]ОН[^А-ЯЁ%a]'] = 'ОН';
	-- 26. БВЛ
	LFGSort_Inst3['БВЛ'] = 'БВЛ';
	LFGSort_Inst3['BWL'] = 'БВЛ';
	LFGSort_Inst3['бвл'] = 'БВЛ';
	LFGSort_Inst3['bwl'] = 'БВЛ';
	LFGSort_Inst3['ЛКТ'] = 'БВЛ';
	LFGSort_Inst3['.*[Лл]огов.*[Кк]рыл.*[Тт]ьм.*'] = 'БВЛ';
	LFGSort_Inst3['.*ЛОГОВ.*КРЫЛ.*ТЬМ.*'] = 'БВЛ';
	--LFGSort_Inst['лкт'] = 'БВЛ'
	-- 27. Накс
	LFGSort_Inst3['[Нн]акс'] = 'НАКС';
	LFGSort_Inst3['НАКС'] = 'НАКС';
	-- 28. Оня
	LFGSort_Inst3['[Оо]никси'] = 'ОНЯ';
	LFGSort_Inst3['ОНЯ'] = 'ОНЯ';
	LFGSort_Inst3['ОНЮ'] = 'ОНЯ';
	LFGSort_Inst3['ОНЯ'] = 'ОНЯ';
	LFGSort_Inst3['ОНИКСИ'] = 'ОНЯ';
	LFGSort_Inst3['[Oo]nyx%a'] = 'ОНЯ';
	
	
	LFGSort_Inst4['[^А-ЯЁ%a]БАСТ'] = 'БАСТ'; -- бастионы адского пламени
	LFGSort_Inst4['[^А-ЯЁ%a]КК[^А-ЯЁ%a]'] = 'КК'; -- кузня крови
	LFGSort_Inst4['УЗИ'] = 'УЗИ'; -- узилище
	LFGSort_Inst4['[^А-ЯЁ%a]ТОПЬ[^А-ЯЁ%a]'] = 'ТОПЬ'; -- нижнетопь
	LFGSort_Inst4['[^А-ЯЁ%a]ГМ[^А-ЯЁ%a]'] = 'ГМ'; -- гробницы маны
	LFGSort_Inst4['АУКГ'] = 'АУКГ'; -- аукенайские гробницы
	LFGSort_Inst4['ПВ1'] = 'ПВ1'; -- предгорья хилсбрада
	LFGSort_Inst4['[^А-ЯЁ%a]СЗ[^А-ЯЁ%a]'] = 'СЗ'; -- сеттекские залы
	LFGSort_Inst4['[^А-ЯЁ%a]ПП[^А-ЯЁ%a]'] = 'ПП'; -- паровое подземелье
	LFGSort_Inst4['[^А-ЯЁ%a]ТЛ[^А-ЯЁ%a]'] = 'ТЛ'; -- темный лабиринт
	LFGSort_Inst4['[^А-ЯЁ%a]РЗ[^А-ЯЁ%a]'] = 'РЗ'; -- разрушенные залы
	LFGSort_Inst4['[^А-ЯЁ%a]МЕХ[^А-ЯЁ%a]'] = 'МЕХ'; -- механар
	LFGSort_Inst4['[^А-ЯЁ%a]БОТ[^А-ЯЁ%a]'] = 'БОТ'; -- ботаника
	LFGSort_Inst4['[^А-ЯЁ%a]ЧТ[^А-ЯЁ%a]'] = 'ЧТ'; -- Черные топи
	LFGSort_Inst4['[^А-ЯЁ%a]АРКА[^А-ЯЁ%a]'] = 'АРКА'; -- акратрац
	LFGSort_Inst4['[^А-ЯЁ%a]ТМ[^А-ЯЁ%a]'] = 'ТМ'; -- террасса магистров


	LFGSort_Inst5['Г-БАСТ'] = 'Г-БАСТ'; -- бастионы адского пламени
	LFGSort_Inst5['Г-КК'] = 'Г-КК'; -- кузня крови
	LFGSort_Inst5['Г-УЗИ'] = 'Г-УЗИ'; -- узилище
	LFGSort_Inst5['Г-ТОПЬ'] = 'Г-ТОПЬ'; -- нижнетопь
	LFGSort_Inst5['Г-ГМ'] = 'Г-ГМ'; -- гробницы маны
	LFGSort_Inst5['Г-АУКГ'] = 'Г-АУКГ'; -- аукенайские гробницы
	LFGSort_Inst5['Г-ПВ1'] = 'Г-ПВ1'; -- предгорья хилсбрада
	LFGSort_Inst5['Г-СЗ'] = 'Г-СЗ'; -- сеттекские залы
	LFGSort_Inst5['Г-ПП'] = 'Г-ПП'; -- паровое подземелье
	LFGSort_Inst5['Г-ТЛ'] = 'Г-ТЛ'; -- темный лабиринт
	LFGSort_Inst5['Г-РЗ'] = 'Г-РЗ'; -- разрушенные залы
	LFGSort_Inst5['Г-МЕХ'] = 'Г-МЕХ'; -- механар
	LFGSort_Inst5['Г-БОТ'] = 'Г-БОТ'; -- ботаника
	LFGSort_Inst5['Г-ЧТ'] = 'Г-ЧТ'; -- Черные топи
	LFGSort_Inst5['Г-АРКА'] = 'Г-АРКА'; -- акратрац
	LFGSort_Inst5['Г-ТМ'] = 'Г-ТМ'; -- террасса магистров

--[^А-ЯЁ%a]
	LFGSort_Inst6['КАРА'] = 'КАРА'; -- каражан
	LFGSort_Inst6['[^А-ЯЁ%a][Кк]ар[ау][^А-ЯЁ%a]'] = 'КАРА'; -- каражан
	LFGSort_Inst6['kara'] = 'КАРА'; -- каражан
	LFGSort_Inst6['Kara'] = 'КАРА'; -- каражан
	LFGSort_Inst6['Kara'] = 'КАРА'; -- каражан
	
	LFGSort_Inst6['ГРУУЛ'] = 'ГРУУЛ'; -- Груул
	LFGSort_Inst6['МАГТ'] = 'МАГТ'; -- Магтеридон
	LFGSort_Inst6['[^А-ЯЁ%a]ЗА[^А-ЯЁ%a]'] = 'ЗА'; -- зул аман
	LFGSort_Inst6['[^А-ЯЁ%a]ЗС[^А-ЯЁ%a]'] = 'ЗС'; -- змеиное святилище
	LFGSort_Inst6['[^А-ЯЁ%a]ТК[^А-ЯЁ%a]'] = 'ТК'; -- око бурь
	LFGSort_Inst6['ХИДЖ'] = 'ХИДЖ'; -- Вершина Хиджала 
	LFGSort_Inst6['[^А-ЯЁ%a]БТ[^А-ЯЁ%a]'] = 'ХРАМ'; -- Черный Храм 
	LFGSort_Inst6['[^А-ЯЁ%a]ПЛАТО[^А-ЯЁ%a]'] = 'ПСК'; --Плато Солнечного Колодца 	

L['LFGSort_Inst_ect'] = LFGSort_Inst_ect;
L['LFGSort_Inst1'] = LFGSort_Inst1
L['LFGSort_Inst2'] = LFGSort_Inst2
L['LFGSort_Inst3'] = LFGSort_Inst3

L['LFGSort_Inst4'] = LFGSort_Inst4
L['LFGSort_Inst5'] = LFGSort_Inst5
L['LFGSort_Inst6'] = LFGSort_Inst6
end
